artillery/user-flow-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - name: 'Light Traffic'
      duration: 20
      arrivalRate: 5
    - name: 'Medium Traffic'
      duration: 20
      arrivalRate: 15
    - name: 'Heavy Traffic'
      duration: 20
      arrivalRate: 30
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: 'Use case 01: Search products and add to cart'
    flow:
      - post:
          url: '/v1/auth/login'
          json:
            email: 'Jordan.Brown@yahoo.com'
            password: '123'
          capture:
            - json: '$.user_id'
              as: userId
            - json: '$.access_token'
              as: token

      - get:
          url: '/v1/products'
          capture:
            - json: '$[0].id'
              as: productId

      - get:
          url: '/v1/cart/user/{{ userId }}'
          headers:
            Authorization: 'Bearer {{ token }}'
          capture:
            - json: '$.id'
              as: cartId

      - post:
          url: '/v1/cart-item/{{ cartId }}/product/{{ productId }}'
          headers:
            Authorization: 'Bearer {{ token }}'
          json:
            quantity: 3